// 7 Запросить у пользователя сумму покупки и вывести сумму к оплате со скидкой: от 200 до 300 – скидка будет 3%, от 300 до 500 – 5%, от 500 и выше – 7%.
var sum = +prompt("Введите сумму к оплате:");
if (sum >= 200 && sum <= 300) {
    alert("\u0426\u0435\u043D\u0430 \u0441\u043E \u0441\u043A\u0438\u0434\u043A\u043E\u0439 3%: " + ((sum / 100) * 3 - sum) + " \u0433\u0440\u043D.");
}
else if (sum >= 300 && sum <= 500) {
    alert("\u0426\u0435\u043D\u0430 \u0441\u043E \u0441\u043A\u0438\u0434\u043A\u043E\u0439 5%: " + ((sum / 100) * 5 - sum) + " \u0433\u0440\u043D.");
}
else if (sum > 500) {
    alert("\u0426\u0435\u043D\u0430 \u0441\u043E \u0441\u043A\u0438\u0434\u043A\u043E\u0439 7%: " + ((sum / 100) * 7 - sum) + " \u0433\u0440\u043D.");
}
else {
    alert("Скидка не предусмотрена.");
}
